# CurveNumberOfSegments Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveNumberOfSegments Property
ParameterTypeId Class See Also
---
"Number of Full Segments"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveNumberOfSegments { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveNumberOfSegments As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveNumberOfSegments {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace